bobmittmann/yard-ice/trunk/src/libdrv/stm32f-usb_cdc.c
/* 
 * Copyright(C) 2012 Robinson Mittmann. All Rights Reserved.
 *
 * This file is part of the YARD-ICE.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 3.0 of the License, or (at your option) any later version.
 * 
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 * 
 * You can receive a copy of the GNU Lesser General Public License from 
 * http://www.gnu.org/
 */

/** 
 * @file stm32f-usb_cdc.c
 * @brief STM32F USB CDC driver
 * @author Robinson Mittmann <bobmittmann@gmail.com>
 */ 

#include <sys/stm32f.h>
#include <arch/cortex-m3.h>
#include <sys/delay.h>
#include <sys/serial.h>
#include <sys/param.h>
#include <sys/mii.h>
#include <stdlib.h>
#include <stdio.h>
#include <stdbool.h>

#include <sys/usb.h>
#include <sys/cdc.h>

int hexdump32(uint32_t addr, int count);

struct usb_descriptor_set_cdc {
	struct usb_descriptor_configuration cfg;
	struct usb_descriptor_interface comm_if;
	struct cdc_header_descriptor hdr;
	struct cdc_call_management_descriptor cm;
	struct cdc_abstract_control_management_descriptor acm;
	struct cdc_union_1slave_descriptor un;
	struct usb_descriptor_endpoint ep_int;
	struct usb_descriptor_interface if_data;
	struct usb_descriptor_endpoint ep_out;
	struct usb_descriptor_endpoint ep_in;
} __attribute__((__packed__));

struct cdc_desc_set {
	struct usb_descriptor_device device;
	struct usb_descriptor_set_cdc conf;
	struct cdc_line_coding line;
} __attribute__((__packed__));

#define EP0 0
//#define EP0_FIFO_SIZE 8
#define EP0_FIFO_SIZE 64

#define EP_OUT 1
#define EP_OUT_SIZE 64

#define EP_IN  2
#define EP_IN_SIZE 64 

#define EP_INT 3
#define EP_INT_SIZE 64

#define RX_FIFO_SIZE 128
#define TX0_FIFO_SIZE 64
#define TX1_FIFO_SIZE 128
#define TX2_FIFO_SIZE 0
#define TX3_FIFO_SIZE 0

#define DFIFIO_ADDR (STM32F_BASE_OTG_FS +  0x20000)
#define DFIFIO (uint32_t *)DFIFIO_ADDR

const struct cdc_desc_set cdc_desc = {
	{
		/* Size of this descriptor in bytes */
		sizeof(struct usb_descriptor_device),
			/* DEVICE descriptor type */
			USB_DESCRIPTOR_DEVICE,
			/* USB specification release number */
			USB2_00,
//			USB1_10,
			/* Class code */
			USB_CLASS_COMMUNICATION,
			/* Subclass code */
			0x00,
			/* Protocol code */
			0x00,
			/* Control endpoint 0 max. packet size */
			EP0_FIFO_SIZE,
			/* Vendor ID */
			USB_VENDOR_ATMEL,
			/* Product ID */
			0x6119,
			/* Device release number */
			0x0001,
			/* Index of manu. string descriptor */
			0x00,
			/* Index of prod. string descriptor */
			0x00,
			/* Index of S.N.  string descriptor */
			0x00,
			/* Number of possible configurations */
			0x01
	}, {
		/* Configuration 1 descriptor */ 
		{
			/* Size of this descriptor in bytes */
			sizeof(struct usb_descriptor_configuration),
			/* CONFIGURATION descriptor type */
			USB_DESCRIPTOR_CONFIGURATION,
			/* Total length of data returned for this configuration */
			sizeof(struct usb_descriptor_set_cdc),
			/* Number of interfaces for this configuration */
			2,
			/* Value to use as an argument for the 
			   Set Configuration request to select this configuration */
			1,
			/* Index of string descriptor describing this configuration */
			0,
			/* Configuration characteristics - attributes */
			USB_CONFIG_SELF_NOWAKEUP,
			/* Maximum power consumption of the device */
			USB_POWER_MA(100)
		},
		/* Communication Class Interface Descriptor Requirement */ 
		{
			/* Size of this descriptor in bytes */
			sizeof(struct usb_descriptor_interface),
			/* INTERFACE descriptor type */
			USB_DESCRIPTOR_INTERFACE,
			/* Number of this interface */
			0,
			/* Value used to select this alternate setting */
			0,
			/* Number of endpoints used by this interface 
			   (excluding endpoint zero) */
			1,
			/* Class code */
			CDC_INTERFACE_COMMUNICATION,
			/* Sub-class */
			CDC_ABSTRACT_CONTROL_MODEL,
			/* Protocol code: (V.25ter, Common AT commands)*/
			CDC_PROTOCOL_COMMON_AT_COMMANDS, 
			/* Index of string descriptor describing this interface */
			0 
		}, 
		/* Header Functional Descriptor */ 
		{
			/* Size of this descriptor in bytes */
			sizeof(struct cdc_header_descriptor),
			/* CS_INTERFACE descriptor type */
			CDC_CS_INTERFACE,
			/* Header functional descriptor subtype */
			CDC_HEADER,
			/* USB CDC specification release version */
			CDC1_10
		},
		/* Call Management Functional Descriptor */ 
		{
			/* Size of this descriptor in bytes */
			sizeof(struct cdc_call_management_descriptor),
			/* CS_INTERFACE descriptor type */
			CDC_CS_INTERFACE,
			/* Call management functional descriptor subtype */
			CDC_CALL_MANAGEMENT,
			/* The capabilities that this configuration supports */
			1, /* D1 + D0 */
			/* Interface number of the data class 
			   interface used for call management */
			1
		},
		/* Abstract Control Management Functional Descriptor */ 
		{
			/* Size of this descriptor in bytes */
			sizeof(struct cdc_abstract_control_management_descriptor),
			/* CS_INTERFACE descriptor type */
			CDC_CS_INTERFACE,
			/* Abstract control management functional descriptor subtype */
			CDC_ABSTRACT_CONTROL_MANAGEMENT,
			/* Capabilities supported by this configuration */
			0x06
		},
		/* Union Functional Descriptor */ 
		{ 
			{
				/* Size of this descriptor in bytes */
				sizeof(struct cdc_union_1slave_descriptor),
				/* CS_INTERFACE descriptor type */
				CDC_CS_INTERFACE,
				/* Union functional descriptor subtype */
				CDC_UNION,
				/* The interface number designated as master */
				0
			},
			/* The interface number designated as first slave */
			{ 1 }
		},
		/* Endpoint 3 descriptor */ 
		{
			/* Size of this descriptor in bytes */
			sizeof(struct usb_descriptor_endpoint),
			/* ENDPOINT descriptor type */
			USB_DESCRIPTOR_ENDPOINT,
			/* Address of the endpoint on the USB device */
			USB_ENDPOINT_IN + EP_INT,
			/* Endpoint attributes when configured */
			ENDPOINT_TYPE_INTERRUPT,
			/* Maximum packet size this endpoint is capable 
			   of sending or receiving */
			EP_INT_SIZE,
			/* Interval for polling endpoint (ms) */
			1
		},
		/* Data Class Interface Descriptor Requirement */ 
		{
			/* Size of this descriptor in bytes */
			sizeof(struct usb_descriptor_interface),
			/* INTERFACE descriptor type */
			USB_DESCRIPTOR_INTERFACE,
			/* Number of this interface */
			1,
			/* Value used to select this alternate setting */
			0,
			/* Number of endpoints used by this interface 
			   (excluding endpoint zero) */
			2,
			/* Class code */
			CDC_INTERFACE_DATA,
			/* Sub-class */
			0,
			/* Protocol code */
			0,
			/* Index of string descriptor describing this interface */
			0 
		},
		/* First alternate setting */ 
		/* Endpoint 1 descriptor */ 
		{
			/* Size of this descriptor in bytes */
			sizeof(struct usb_descriptor_endpoint),
			/* ENDPOINT descriptor type */
			USB_DESCRIPTOR_ENDPOINT,
			/* Address of the endpoint on the USB device */
			USB_ENDPOINT_OUT + EP_OUT,
			/* Endpoint attributes when configured */
			ENDPOINT_TYPE_BULK,
			/* Maximum packet size this endpoint is capable of 
			   sending or receiving */
			EP_OUT_SIZE,
			/* Interval for polling endpoint for data transfers */
			0x00
		},
		/* Endpoint 2 descriptor */ 
		{
			/* Size of this descriptor in bytes */
			sizeof(struct usb_descriptor_endpoint),
			/* ENDPOINT descriptor type */
			USB_DESCRIPTOR_ENDPOINT,
			/* Address of the endpoint on the USB device */
			USB_ENDPOINT_IN + EP_IN,
			/* Endpoint attributes when configured */
			ENDPOINT_TYPE_BULK,
			/* Maximum packet size this endpoint is capable of 
			   sending or receiving */
			EP_IN_SIZE,
			/* Interval for polling endpoint for data transfers */
			0x0
		}
	}, {
		115200,
		0,
		0,
		8
	} 
};
