bobmittmann/yard-ice/trunk/src/libdrv/stm32f-usb_cdc.c
#if 0
struct usb_cdc {
	uint8_t rx_bank: 1;
	uint8_t set_addr: 1;
	volatile uint8_t dte: 1;
	volatile uint8_t cd: 1;
	volatile uint8_t lc: 1;

	uint16_t line_coding;

	volatile uint8_t ping;
	volatile uint8_t pong;

	uint8_t addr;

	uint8_t rx_count;
	/* descriptor buffer pointers */
	uint8_t tx_pos;
	uint8_t tx_rem;
};
#endif

struct usb_dev {
	struct stm32f_otg_fs * otg_fs;

	uint8_t rx_count;
	/* ep0 tx info */
	uint8_t tx_rem;
	uint8_t tx_len;
	uint8_t * tx_ptr;
	
	uint32_t setup[2];
};

#define OTG_FS_DP PA, 12
#define OTG_FS_DM PA, 11
#define OTG_FS_VBUS PA, 9
#define OTG_FS_ID PA, 10

static void core_reset(struct stm32f_otg_fs * otg_fs)
{
	/* Wait for AHB master IDLE state. */
	while (!(otg_fs->grstctl & OTG_FS_AHBIDL)) {
		udelay(3);
	}

	/* Core Soft Reset */
	otg_fs->grstctl = OTG_FS_CSRST;
	do {
		udelay(3);
	} while (otg_fs->grstctl & OTG_FS_CSRST);

	/* Wait for 3 PHY Clocks*/
	udelay(3);

	/* AHB configuration */
	otg_fs->gahbcfg = OTG_FS_TXFELVL | OTG_FS_GINTMSK; 
}

static void txfifo_flush(struct stm32f_otg_fs * otg_fs, int num)
{
	otg_fs->grstctl = OTG_FS_TXFFLSH | OTG_FS_TXFIFO_SET(num);
	do {
		udelay(3);
	} while (otg_fs->grstctl & OTG_FS_TXFFLSH);
	/* Wait for 3 PHY Clocks*/
	udelay(3);
}


void usb_device_init(struct usb_dev * usb)
{
	struct stm32f_rcc * rcc = STM32F_RCC;
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	uint32_t depctl;
	int i;

	usb->otg_fs = otg_fs;
	usb->tx_ptr = NULL;
	usb->tx_rem = 0;


	printf(" - Enabling USB FS clock...\n");
	rcc->ahb2enr |= RCC_OTGFSEN;

	/* - Force device mode 
	   - Full Speed serial transceiver select */
	otg_fs->gusbcfg = OTG_FS_TRDT_SET(5) | OTG_FS_FDMOD | OTG_FS_PHYSEL;

	/* Reset after a PHY select and set Device mode */
	core_reset(otg_fs);

	/* Restart the Phy Clock */
	otg_fs->pcgcctl = 0;

	/* Flush the FIFOs */
//	USB_OTG_FlushTxFifo(pdev , 0x10); 
//	USB_OTG_FlushRxFifo(pdev);

	/* Clear all pending Device Interrupts */
	otg_fs->diepmsk = 0;
	otg_fs->doepmsk = 0;
	otg_fs->daint = 0xffffffff;
	otg_fs->daintmsk = 0;
	for (i = 0; i < 4; i++) {
		depctl = otg_fs->inep[i].diepctl;
		depctl = (depctl & OTG_FS_EPENA) ? OTG_FS_EPDIS | OTG_FS_SNAK : 0;
		otg_fs->inep[i].diepctl = depctl;
		otg_fs->inep[i].dieptsiz = 0;
		otg_fs->inep[i].diepint = 0xff;
	}
	for (i = 0; i < 4; i++) {
		depctl = otg_fs->outep[i].doepctl;
		depctl = (depctl & OTG_FS_EPENA) ? OTG_FS_EPDIS | OTG_FS_SNAK : 0;
		otg_fs->outep[i].doepctl = depctl;
		otg_fs->outep[i].doeptsiz = 0;
		otg_fs->outep[i].doepint = 0xff;
	}

	/* Enable wakeup interrupt */
	otg_fs->gintmsk = OTG_FS_WUIM;

	/* Enable Cortex interrupts */
	cm3_irq_enable(STM32F_IRQ_OTG_FS);

	/* The application must perform the following steps to initialize the 
	   core as a device on power-up or after a mode change from host to device.
	1. Program the following fields in the OTG_FS_DCFG register:
	– Device speed
	- Non-zero-length status OUT handshake */
	otg_fs->dcfg = OTG_FS_PFIVL_80 | OTG_FS_DSPD_FULL;

	/* 2. Program the OTG_FS_GINTMSK register to unmask the 
	   following interrupts:
	   – USB reset
	   – Enumeration done
	   – Early suspend
	   – USB suspend
	   – SOF */
	otg_fs->gintmsk |= OTG_FS_USBRSTM | OTG_FS_ENUMDNEM | OTG_FS_ESUSPM | 
		OTG_FS_USBSUSPM; //| OTG_FS_SOFM;

	/* 3. Program the VBUSBSEN bit in the OTG_FS_GCCFG register to enable VBUS 
	   sensing in “B” device mode and supply the 5 volts across the pull-up 
	   resistor on the DP line. */
	otg_fs->gccfg = OTG_FS_VBUSBSEN | OTG_FS_PWRDWN;

	/* 4. Wait for the USBRST interrupt in OTG_FS_GINTSTS. It indicates that 
	   a reset has been detected on the USB that lasts for about 10 ms on 
	   receiving this interrupt. Wait for the ENUMDNE interrupt in 
	   OTG_FS_GINTSTS.
	   This interrupt indicates the end of reset on the USB. On receiving this 
	   interrupt, the application must read the OTG_FS_DSTS register to 
	   determine the enumeration speed and perform the steps listed in 
	   Endpoint initialization on enumeration completion on page 1035.
	   At this point, the device is ready to accept SOF packets and perform 
	   control transfers on control endpoint 0. */
}

void usb_on_reset(struct stm32f_otg_fs * otg_fs)
{
	uint32_t addr;
	uint32_t siz;
	int i;

	/* Clear the Remote Wake-up Signaling */
	otg_fs->dctl &= ~OTG_FS_RWUSIG;

	/* Flush the Tx FIFO */
	txfifo_flush(otg_fs, 0);

	/* Clear all pending interrupts */
	otg_fs->daint = 0xffffffff;
	for (i = 0; i < 4; i++) {
		otg_fs->inep[i].diepint = 0xff;
		otg_fs->outep[i].doepint = 0xff;
	}
	
	/* Reset Device Address */
	otg_fs->dcfg &= ~OTG_FS_DAD_MSK;

	/* Endpoint initialization on USB reset */

	/* 1. Set the NAK bit for all OUT endpoints
	   – SNAK = 1 in OTG_FS_DOEPCTLx (for all OUT endpoints) */
	otg_fs->outep[EP0].doepctl = OTG_FS_SNAK;
	otg_fs->outep[EP_OUT].doepctl = OTG_FS_SNAK;

	/* 2. Unmask the following interrupt bits
	   – INEP0 = 1 in OTG_FS_DAINTMSK (control 0 IN endpoint)
	   – OUTEP0 = 1 in OTG_FS_DAINTMSK (control 0 OUT endpoint)
	   – STUP = 1 in DOEPMSK
	   – XFRC = 1 in DOEPMSK
	   – XFRC = 1 in DIEPMSK
	   – TOC = 1 in DIEPMSK */
	otg_fs->daintmsk = OTG_FS_IEPM0 | OTG_FS_OEPM0;
	otg_fs->doepmsk = OTG_FS_STUPM | OTG_FS_XFRCM | OTG_FS_EPDM;
	otg_fs->diepmsk = OTG_FS_XFRCM | OTG_FS_TOM | OTG_FS_EPDM;

	/* 3. Set up the Data FIFO RAM for each of the FIFOs
	   – Program the OTG_FS_GRXFSIZ register, to be able to receive 
	   control OUT data and setup data. If thresholding is not enabled, 
	   at a minimum, this must be equal to 1 max packet size of 
	   control endpoint 0 + 2 Words (for the status of the control OUT 
	   data packet) + 10 Words (for setup packets).
	   - Program the OTG_FS_TX0FSIZ register (depending on the FIFO number 
	   chosen) to be able to transmit control IN data. At a minimum, this 
	   must be equal to 1 max packet size of control endpoint 0. */

	/* EP0 and EP2 RX fifo memory allocation */
	addr = 0;
	siz = RX_FIFO_SIZE;
	otg_fs->grxfsiz = siz;

	/* EP0 TX fifo memory allocation */
	addr += siz;
	siz = TX0_FIFO_SIZE;
	otg_fs->dieptxf0 = OTG_FS_TX0FD_SET(siz) | OTG_FS_TX0FSA_SET(addr);

	/* EP1 TX fifo memory allocation */
	addr += siz;
	siz = TX1_FIFO_SIZE;
	otg_fs->dieptxf1 = OTG_FS_INEPTXFD_SET(siz) | OTG_FS_INEPTXSA_SET(addr);

	/* EP2 TX fifo memory allocation */
	addr += siz;
	siz = TX2_FIFO_SIZE;
	otg_fs->dieptxf2 = OTG_FS_INEPTXFD_SET(siz) | OTG_FS_INEPTXSA_SET(addr);

	/* EP3 TX fifo memory allocation */
	addr += siz;
	siz = TX3_FIFO_SIZE;
	otg_fs->dieptxf3 = OTG_FS_INEPTXFD_SET(siz) | OTG_FS_INEPTXSA_SET(addr);

	/*  4. Program the following fields in the endpoint-specific registers 
	   for control OUT endpoint 0 to receive a SETUP packet
	   – STUPCNT = 3 in OTG_FS_DOEPTSIZ0 (to receive up to 3 back-to-back 
	   SETUP packets)
	   At this point, all initialization required to receive SETUP packets 
	   is done. */
	otg_fs->outep[0].doeptsiz = OTG_FS_STUPCNT_SET(3) | 
		OTG_FS_PKTCNT_SET(1) | OTG_FS_XFRSIZ_SET(8 * 3);

	otg_fs->gintmsk |=  OTG_FS_IEPINTM | OTG_FS_OEPINTM | 
		OTG_FS_IISOIXFRM | OTG_FS_IISOOXFRM | OTG_FS_RXFLVLM;

	printf(" - USB reseted.\n");
}

void usb_on_enum_done(struct stm32f_otg_fs * otg_fs)
{
	uint32_t diepctl;
	uint32_t dsts;

	/* Endpoint initialization on enumeration completion 
	   1. On the Enumeration Done interrupt (ENUMDNE in OTG_FS_GINTSTS), 
	   read the OTG_FS_DSTS register to determine the enumeration speed. */
	dsts = otg_fs->dsts;
	
	/* 2. Program the MPSIZ field in OTG_FS_DIEPCTL0 to set the maximum 
	   packet size. This step configures control endpoint 0. The maximum 
	   packet size for a control endpoint depends on the enumeration speed. */

	diepctl = otg_fs->inep[0].diepctl;
	diepctl &= ~OTG_FS_MPSIZ_MSK;
	if ((dsts & OTG_FS_ENUMSPD_MSK) == OTG_FS_ENUMSPD_FULL) { 
		diepctl |= OTG_FS_MPSIZ_64;
		printf(" - USB full speed\n");
	} else {
		diepctl |= OTG_FS_MPSIZ_8;
		printf(" - USB speed ???\n");
	}
	otg_fs->inep[0].diepctl = diepctl;

	/* At this point, the device is ready to receive SOF packets and is 
	   configured to perform control transfers on control endpoint 0. */

	/*  Clear global IN NAK */
	otg_fs->dctl |= OTG_FS_CGINAK;

