bobmittmann/yard-ice/trunk/src/libdrv/stm32f-usb_cdc.c
}

void usb_on_set_addr(struct stm32f_otg_fs * otg_fs, int addr)
{
	uint32_t dcfg;
	/*  Endpoint initialization on SetAddress command */

	/* This section describes what the application must do when it 
	   receives a SetAddress command in a SETUP packet.
	   1. Program the OTG_FS_DCFG register with the device address 
	   received in the SetAddress command */
	dcfg = otg_fs->dcfg; 
	dcfg &= ~OTG_FS_DAD_MSK;
	dcfg |= OTG_FS_DAD_SET(addr);
	otg_fs->dcfg = dcfg;

	/* 2. Program the core to send out a status IN packet */
}

void usb_on_set_configt(struct stm32f_otg_fs * otg_fs, int id)
{
	if (id == 0) {
		/* Diable endpoints interrupts */
		otg_fs->daintmsk &= ~(OTG_FS_IEPM(EP_IN) | OTG_FS_OEPM(EP_OUT));

		/* Disable endpoints */
		otg_fs->outep[EP_OUT].doepctl &= ~OTG_FS_USBAEP;
		otg_fs->outep[EP_OUT].doepctl &= ~OTG_FS_USBAEP;

		otg_fs->outep[EP_IN].doepctl |= OTG_FS_EPDIS | OTG_FS_SNAK;
		return;
	}
	/* Endpoint activation
	   This section describes the steps required to activate a device 
	   endpoint or to configure an existing device endpoint to a 
	   new type.
	   1. Program the characteristics of the required endpoint into 
	   the following fields of the OTG_FS_DIEPCTLx register (for IN or 
	   bidirectional endpoints) or the OTG_FS_DOEPCTLx register (for 
	   OUT or bidirectional endpoints).
	   – Maximum packet size
	   – USB active endpoint = 1
	   – Endpoint start data toggle (for interrupt and bulk endpoints)
	   – Endpoint type
	   – TxFIFO number */
	/* 2. Once the endpoint is activated, the core starts decoding the 
	   tokens addressed to that endpoint and sends out a valid 
	   handshake for each valid token received for the
	   endpoint. */

	/* Activate OUT endpoint */
	otg_fs->outep[EP_OUT].doepctl = OTG_FS_MPSIZ_SET(64) |
		OTG_FS_USBAEP | OTG_FS_SD0PID | OTG_FS_EPTYP_BULK | 
		OTG_FS_TXFNUM_SET(0);

//	otg_fs->outep[EP_OUT].doeptsiz = OTG_FS_STUPCNT_SET(3) | 
//		OTG_FS_PKTCNT_SET(1) | OTG_FS_XFRSIZ_SET(64);

	/* Activate IN endpoint */
	otg_fs->inep[EP_IN].diepctl = OTG_FS_MPSIZ_SET(64) |
		OTG_FS_USBAEP | OTG_FS_SD0PID | OTG_FS_EPTYP_BULK |
		OTG_FS_TXFNUM_SET(1);

	/* Enable endpoints interrupts */
	otg_fs->daintmsk |= OTG_FS_IEPM(EP_IN) | OTG_FS_OEPM(EP_OUT);

	/* Prepare to receive */
	otg_fs->outep[EP_OUT].doeptsiz = OTG_FS_PKTCNT_SET(1) | 
		OTG_FS_XFRSIZ_SET(64);
	/* EP enable */
	otg_fs->outep[EP_OUT].doepctl |= OTG_FS_EPENA | OTG_FS_CNAK;

}

static void usb_ep0_tx(struct usb_dev * dev)
{
	struct stm32f_otg_fs * otg_fs = dev->otg_fs;
	uint8_t * cp;
	int free;
	int len;
	int i;
	uint32_t deptsiz;

	free = otg_fs->inep[0].dtxfsts * 4;

	printf(" - free=%d\n", free);
	len = dev->tx_len;
	
	deptsiz = otg_fs->inep[0].dieptsiz;
	printf(" - pkts=%d size=%d\n", OTG_FS_PKTCNT_GET(deptsiz),
		   OTG_FS_XFRSIZ_GET(deptsiz)); 

//	while ((dev->tx_len > 0) && (free >= len)) {
	if ((len > 0) && (free >= len)) {

		printf("Tx: (%d)\n", len);

		cp = dev->tx_ptr;
		for (i = 0; i < len; i += 4) {
			uint32_t data;
			data = cp[0] + (cp[1] << 8) + (cp[2] << 16) + (cp[3] << 24);
			otg_fs->dfifo[0].push = data;
			cp += 4;
		}	

		dev->tx_ptr += len;
		dev->tx_rem -= len;
		dev->tx_len -= len;
	}
}

void usb_ep0_tx_start(struct usb_dev * dev, void * ptr, int len)
{
	struct stm32f_otg_fs * otg_fs = dev->otg_fs;
	uint32_t depctl;
	uint32_t deptsiz;

	dev->tx_ptr = (uint8_t *)ptr;
	dev->tx_rem = len;

	depctl = otg_fs->inep[0].diepctl;
	deptsiz = otg_fs->inep[0].dieptsiz;

	if (len > 0) {
		dev->tx_len = MIN(len, EP0_FIFO_SIZE);
		deptsiz = OTG_FS_PKTCNT_SET(1) | OTG_FS_XFRSIZ_SET(dev->tx_len); 
	} else {
		dev->tx_len = 0;
		deptsiz = OTG_FS_PKTCNT_SET(1) | OTG_FS_XFRSIZ_SET(0); 
	}
	otg_fs->inep[0].dieptsiz = deptsiz;

	depctl |= OTG_FS_EPENA | OTG_FS_CNAK;
	otg_fs->inep[0].diepctl = depctl; 

	if (len > 0) {
		/* umask FIFO empty interrupt */
		otg_fs->diepempmsk |= (1 << EP0);
	}
}

void usb_on_recv(struct usb_dev * dev, int ep, int len)
{
	struct stm32f_otg_fs * otg_fs = dev->otg_fs;
	uint32_t data;
	int i;

	printf(" - Rx: (%d)", len);
	for (i = 0; i < len; i += 4) {
		data = otg_fs->dfifo[ep].pop;
		printf(" %08x", data);
	}
	printf("\n");

	/* Prepare to receive more */
	otg_fs->outep[ep].doeptsiz = OTG_FS_PKTCNT_SET(1) | 
		OTG_FS_XFRSIZ_SET(64);
	/* EP enable */
	otg_fs->outep[ep].doepctl |= OTG_FS_EPENA | OTG_FS_CNAK;
}

void usb_on_setup(struct usb_dev * dev)
{
	struct stm32f_otg_fs * otg_fs = dev->otg_fs;
	unsigned int data;
	int req_type;
	int request;
	int value;
	int	index;
	int desc;
	int len;

	req_type = (dev->setup[0] >> 0) & 0xff;
	request = (dev->setup[0] >> 8) & 0xff;
	value = (dev->setup[0] >> 16) & 0xffff;
	index = (dev->setup[1] >> 0) & 0xffff;
	len = (dev->setup[1] >> 16) & 0xffff;

	if (req_type & 0x80) {
		printf("Setup: In\n");
		/* XXX: change direction */
	} else {
		printf("Setup: Out\n");
	}

	/* Handle supported standard device request Cf 
	   Table 9-3 in USB specification Rev 1.1 */

	switch ((request << 8) | req_type) {

	case STD_GET_DESCRIPTOR:
		desc = value >> 8;

		if (desc == USB_DESCRIPTOR_DEVICE) {	
			/* Return Device Descriptor */
			len = MIN(sizeof(struct usb_descriptor_device), len);
			printf("GetDesc: Device: len=%d\n", len);
			usb_ep0_tx_start(dev, (void *)&cdc_desc, len);
			break;
		} 
		
		if (desc == USB_DESCRIPTOR_CONFIGURATION)	{
			/* Return Configuration Descriptor */
			len = MIN(sizeof(struct usb_descriptor_set_cdc), len);
			printf("GetDesc: Config: len=%d\n", len);
			usb_ep0_tx_start(dev, (void *)&cdc_desc.conf, len);
			break;
		} 

		printf("GetDesc: %d ?\n", desc);
		goto stall;

	case STD_SET_ADDRESS:
		printf("SetAddr: %d\n", value);
		usb_on_set_addr(otg_fs, value);
		goto send_zlp;

	case STD_SET_CONFIGURATION:
		printf("SetCfg: %d\n", value);
		usb_on_set_configt(otg_fs, value);
		goto send_zlp;

	case STD_GET_CONFIGURATION:
		printf("GetCfg\n");
		data = 0;
//		data = (udp->glb_stat & UDP_CONFG) ? 1 : 0;
		goto send_word;

	case STD_GET_STATUS_INTERFACE:
		printf("GetStIf\n");
		data = 0;
		goto send_word;

	case STD_GET_STATUS_ZERO:
		printf("GetStZr\n");
		data = 0;
		goto send_word;

	case STD_GET_STATUS_ENDPOINT:
		index &= 0x0f;
		printf("GetStEpt:%d\n", index);
#if 0
		if ((udp->glb_stat & UDP_CONFG) && (index <= 3)) {
			data = (udp->csr[index] & UDP_EPEDS) ? 0 : 1;
			goto send_word;
		} 

