bobmittmann/yard-ice/trunk/src/libdrv/stm32f-usb_cdc.c
		if ((udp->glb_stat & UDP_FADDEN) && (index == 0)) {
			data = (udp->csr[index] & UDP_EPEDS) ? 0 : 1;
			goto send_word;
		}
#endif
		goto stall;

	case STD_SET_FEATURE_INTERFACE:
		printf("SetIf\n");
		goto send_zlp;

	case STD_SET_FEATURE_ENDPOINT:
		printf("SetEpt\n");
		index &= 0x0f;
#if 0
		if ((value == 0) && index && (index <= 3)) {
			udp->csr[index] = 0;
			goto send_zlp;
		}
#endif
		goto stall;

	case STD_CLEAR_FEATURE_ZERO:
		printf("ClrZr\n");
		goto stall;

	case STD_CLEAR_FEATURE_INTERFACE:
		printf("ClrIf\n");
		goto send_zlp;

	case STD_CLEAR_FEATURE_ENDPOINT:
		index &= 0x0f;
		printf("ClrEpt: %d\n", index);
#if 0
		if ((value == 0) && index && (index <= 3)) {
			if (index == EP_OUT)
				udp->csr[EP_OUT] =
					(UDP_EPEDS | UDP_EPTYPE_BULK_OUT);

			else if (index == EP_IN)
				udp->csr[EP_IN] =
					(UDP_EPEDS | UDP_EPTYPE_BULK_IN);

#if USB_CDC_ENABLE_STATE
			else if (index == EP_INT)
				udp->csr[EP_INT] = 
					(UDP_EPEDS | UDP_EPTYPE_INT_IN);
#endif

			goto send_zlp;
		}
#endif
		goto stall;

		/* handle CDC class requests */
	case SET_LINE_CODING:
		printf("CDC SetLn: idx=%d val=%d len=%d ", index, value, len);
		goto send_zlp;

	case GET_LINE_CODING:
		printf("CDC GetLn");
		len = MIN(sizeof(struct cdc_line_coding), len);
		usb_ep0_tx_start(dev, (void *)&cdc_desc.line, len);
		break;

	case SET_CONTROL_LINE_STATE:
		printf("CDC SetCtrl: idx=%d val=%d len=%d ", index, value, len);
		goto send_zlp;

	default:
		printf("CDC t=%x r=%x v=%x i=%d l=%d\n", 
				req_type, request, value, index, len); 
		goto stall;
	}

	return;

send_zlp:
	printf("Send: ZLP\n");
	otg_fs->inep[0].dieptsiz = OTG_FS_PKTCNT_SET(1) | OTG_FS_XFRSIZ_SET(0); 
	otg_fs->inep[0].diepctl |= OTG_FS_EPENA | OTG_FS_CNAK;
	return;

stall:
	printf("Stall!\n");
	otg_fs->inep[0].diepctl |= OTG_FS_EPDIS | OTG_FS_STALL;
	return;

send_word:
	printf("Send: 0x%04x\n", data);
	dev->tx_rem = 0;
	otg_fs->dfifo[0].push = data;
	otg_fs->inep[0].dieptsiz = OTG_FS_PKTCNT_SET(1) | OTG_FS_XFRSIZ_SET(2); 
	otg_fs->inep[0].diepctl |= OTG_FS_EPENA | OTG_FS_CNAK;
	return;
}

void usb_on_rxflvl(struct usb_dev * dev)
{
	struct stm32f_otg_fs * otg_fs = dev->otg_fs;
	uint32_t grxstsp;
	int ep;
	int len;
	int stat;

	/* 1. On catching an RXFLVL interrupt (OTG_FS_GINTSTS register), 
	   the application must read the Receive status pop 
	   register (OTG_FS_GRXSTSP). */
	grxstsp = otg_fs->grxstsp;

	/* 2. The application can mask the RXFLVL interrupt (in OTG_FS_GINTSTS) 
	   by writing to RXFLVL = 0 (in OTG_FS_GINTMSK), until it has read the 
	   packet from the receive FIFO. */
	otg_fs->gintmsk &= ~OTG_FS_RXFLVLM;

	len = OTG_FS_BCNT_GET(grxstsp);
	ep = OTG_FS_EPNUM_GET(grxstsp);
	stat = OTG_FS_PKTSTS_GET(grxstsp); 
	printf("- RX, ep=%d len=%d status=%d\n", ep, len, stat);

	/* 3. If the received packet’s byte count is not 0, the byte count 
	   amount of data is popped from the receive Data FIFO and stored in 
	   memory. If the received packet byte count is 0, no data is popped 
	   from the receive data FIFO. */

	switch (grxstsp & OTG_FS_PKTSTS_MSK) {
	case OTG_FS_PKTSTS_GOUT_NACK:
		printf("<GOUT_NACK>");
		break;
	case OTG_FS_PKTSTS_DATA_UPDT:
		printf("<DATA_UPDT>");
		if (len) {
			usb_on_recv(dev, ep, len);
		}
		break;
	case OTG_FS_PKTSTS_XFER_COMP:
		printf("<XFER_COMP>");
		break;
	case OTG_FS_PKTSTS_SETUP_COMP:
		printf("<SETUP_COMP>");
		break;
	case OTG_FS_PKTSTS_SETUP_UPDT:
		printf("<SETUP_UPDT>");
	   /* Copy the setup packet received in FIFO into the setup buffer in RAM */
		dev->setup[0] = otg_fs->dfifo[0].pop;
		dev->setup[1] = otg_fs->dfifo[0].pop;
		break;
	}	

	/* 5. After the data payload is popped from the receive FIFO, the 
	   RXFLVL interrupt (OTG_FS_GINTSTS) must be unmasked. */
	otg_fs->gintmsk |= OTG_FS_RXFLVLM;
}

void usb_on_inepint0(struct usb_dev * dev)
{
	struct stm32f_otg_fs * otg_fs = dev->otg_fs;
	uint32_t diepint;
	uint32_t msk;

	msk = otg_fs->diepmsk;
	/* add the Transmit FIFO empty bit to the mask */
	msk |= ((otg_fs->diepempmsk >> 0) & 0x1) << 7;
	diepint = otg_fs->inep[0].diepint & msk;

	if (diepint & OTG_FS_TXFE) {
		printf("<TXFE>");
		usb_ep0_tx(dev);
		/* clear interrupt */
		otg_fs->inep[0].diepint = OTG_FS_TXFE;
	}
	if (diepint & OTG_FS_INEPNE) {
		printf("<INEPNE>");
		/* clear interrupt */
		otg_fs->inep[0].diepint = OTG_FS_INEPNE;
	}
	if (diepint & OTG_FS_ITTXFE) {
		printf("<ITTXFE>");
		/* clear interrupt */
		otg_fs->inep[0].diepint = OTG_FS_ITTXFE;
	}
	if (diepint & OTG_FS_TOC) {
		printf("<TOC>");
		/* clear interrupt */
		otg_fs->inep[0].diepint = OTG_FS_TOC;
	}
	if (diepint & OTG_FS_EPDISD) {
		printf("<EPDISD>");
		/* clear interrupt */
		otg_fs->inep[0].diepint = OTG_FS_EPDISD;
	}
	if (diepint & OTG_FS_XFRC) {
		printf("<XFRC>");
		/* mask FIFO empty interrupt */
		otg_fs->diepempmsk &= ~(1 << EP0);
		/* clear interrupt */
		otg_fs->inep[0].diepint = OTG_FS_XFRC;
		/* TX complete */
		if (dev->tx_rem)
			usb_ep0_tx_start(dev, dev->tx_ptr, dev->tx_rem);
		else {
			/* Prepare to receive */
			otg_fs->outep[0].doeptsiz = OTG_FS_STUPCNT_SET(3) | 
				OTG_FS_PKTCNT_SET(1) | OTG_FS_XFRSIZ_SET(64);
			/* EP enable */
			otg_fs->outep[0].doepctl |= OTG_FS_EPENA | OTG_FS_CNAK;
		}
	}
}

void usb_on_inepint(struct usb_dev * dev, int id)
{
	struct stm32f_otg_fs * otg_fs = dev->otg_fs;
	uint32_t diepint;
	uint32_t msk;

	msk = otg_fs->diepmsk;
	/* add the Transmit FIFO empty bit to the mask */
	msk |= ((otg_fs->diepempmsk >> id) & 0x1) << 7;
	diepint = otg_fs->inep[id].diepint & msk;

	if (diepint & OTG_FS_TXFE) {
		printf("<TXFE>");
		/* clear interrupt */
		otg_fs->inep[id].diepint = OTG_FS_TXFE;
	}
	if (diepint & OTG_FS_INEPNE) {
		printf("<INEPNE>");
		/* clear interrupt */
		otg_fs->inep[id].diepint = OTG_FS_INEPNE;
	}
	if (diepint & OTG_FS_ITTXFE) {
		printf("<ITTXFE>");
		/* clear interrupt */
		otg_fs->inep[id].diepint = OTG_FS_ITTXFE;
	}
	if (diepint & OTG_FS_TOC) {
		printf("<TOC>");
		/* clear interrupt */
		otg_fs->inep[id].diepint = OTG_FS_TOC;
	}
	if (diepint & OTG_FS_EPDISD) {
		printf("<EPDISD>");
		/* clear interrupt */
		otg_fs->inep[id].diepint = OTG_FS_EPDISD;
	}
	if (diepint & OTG_FS_XFRC) {
		printf("<XFRC>");
		/* mask FIFO empty interrupt */
		otg_fs->diepempmsk &= ~(1 << EP0);
		/* clear interrupt */
		otg_fs->inep[id].diepint = OTG_FS_XFRC;
	}
}


