bobmittmann/yard-ice/trunk/src/libdrv/stm32f-usb_cdc.c
void usb_on_oepint0(struct usb_dev * dev)
{
	struct stm32f_otg_fs * otg_fs = dev->otg_fs;
	uint32_t doepint;

	doepint = otg_fs->outep[0].doepint & otg_fs->doepmsk;

	if (doepint & OTG_FS_XFRC) {
		printf("<XFRC>"); 
		/* clear interrupt */
		otg_fs->outep[0].doepint = OTG_FS_XFRC;
	}
	if (doepint & OTG_FS_EPDISD) {
		printf("<EPDISD>"); 
		/* clear interrupt */
		otg_fs->outep[0].doepint = OTG_FS_EPDISD;
	}
	if (doepint & OTG_FS_STUP) {
		printf("<STUP>"); 
		usb_on_setup(dev);
		/* clear interrupt */
		otg_fs->outep[0].doepint = OTG_FS_STUP;
	}
}

void usb_on_oepint(struct usb_dev * dev, int id)
{
	struct stm32f_otg_fs * otg_fs = dev->otg_fs;
	uint32_t doepint;

	doepint = otg_fs->outep[id].doepint & otg_fs->doepmsk;

	if (doepint & OTG_FS_XFRC) {
		printf("<XFRC>"); 
		/* clear interrupt */
		otg_fs->outep[id].doepint = OTG_FS_XFRC;
	}
	if (doepint & OTG_FS_EPDISD) {
		printf("<EPDISD>"); 
		/* clear interrupt */
		otg_fs->outep[id].doepint = OTG_FS_EPDISD;
	}
	if (doepint & OTG_FS_STUP) {
		printf("<STUP>"); 
		/* clear interrupt */
		otg_fs->outep[id].doepint = OTG_FS_STUP;
	}
}

void usb_on_inep(struct usb_dev * dev)
{
	struct stm32f_otg_fs * otg_fs = dev->otg_fs;
	uint32_t ep_intr;

	ep_intr = (otg_fs->daint & otg_fs->daintmsk);

	if (ep_intr & OTG_FS_IEPINT0) {
		printf("{0}");
		usb_on_inepint0(dev);
	};

	if (ep_intr & OTG_FS_IEPINT1) {
		printf("{1}");
		usb_on_inepint(dev, 1);
	};

	if (ep_intr & OTG_FS_IEPINT2) {
		printf("{2}");
		usb_on_inepint(dev, 2);
	};

	if (ep_intr & OTG_FS_IEPINT3) {
		printf("{3}");
		usb_on_inepint(dev, 3);
	};
	return;

}

void usb_on_outep(struct usb_dev * dev)
{
	struct stm32f_otg_fs * otg_fs = dev->otg_fs;
	uint32_t ep_intr;

	ep_intr = (otg_fs->daint & otg_fs->daintmsk);

	if (ep_intr & OTG_FS_OEPINT0) {
		printf("{0}"); 
		usb_on_oepint0(dev);
	};

	if (ep_intr & OTG_FS_OEPINT1) {
		printf("{1}"); 
		usb_on_oepint(dev, 1);
	};

	if (ep_intr & OTG_FS_OEPINT2) {
		printf("{2}"); 
		usb_on_oepint(dev, 2);
	};

	if (ep_intr & OTG_FS_OEPINT3) {
		printf("{3}"); 
		usb_on_oepint(dev, 3);
	};
}


struct usb_dev usb_dev;

void stm32f_otg_fs_isr(void)
{
	static int sof = 0;
	struct usb_dev * dev = &usb_dev;
	struct stm32f_otg_fs * otg_fs = dev->otg_fs;
	uint32_t gintsts;

	gintsts = otg_fs->gintsts;

	if (gintsts & OTG_FS_RXFLVL) {
		printf("<RXFLVL>\n"); 
		usb_on_rxflvl(dev);
	}

	if (gintsts & OTG_FS_SOF) {
//		printf("[SOF]"); 
//		printf(">"); 
		sof++;
	}

	if (gintsts & OTG_FS_WKUPINT) {
		printf("<WKUPINT> [ATTACHED]\n"); 
		/* disable resume/wakeup interrupts */
	}

	if (gintsts & OTG_FS_USBRST ) {
		/* end of bus reset */
		printf("<USBRST> [DEFAULT]\n"); 
		usb_on_reset(otg_fs);
		dev->rx_count = 0;
		dev->tx_rem = 0;
	}

	if (gintsts & OTG_FS_ENUMDNE) {
		printf("<ENUMDNE>"); 
		usb_on_enum_done(otg_fs);
	}

	if (gintsts & OTG_FS_ESUSP) {
		printf("<ESUSP>"); 
	}

	if (gintsts & OTG_FS_USBSUSP) {
		printf("<USBSUSP>"); 
	}

	if (gintsts & OTG_FS_IEPINT) {
		printf("<IEPINT>"); 
		usb_on_inep(dev);
	}

	if (gintsts & OTG_FS_OEPINT) {
		printf("<OEPINT>"); 
		usb_on_outep(dev);
	}

	if (gintsts & OTG_FS_IISOIXFR) {
		printf("<IISOIXFR>"); 
	}

	if (gintsts & OTG_FS_INCOMPISOOUT) {
		printf("<INCOMPISOOUT>"); 
	}

	if (gintsts & OTG_FS_MMIS) {
		printf("<MMIS>"); 
	}

	/* clear pending interrupts */
	otg_fs->gintsts = gintsts;
}

void usb_io_init(void)
{
	printf(" - Enabling GPIO clock...\n");
	stm32f_gpio_clock_en(PA);

	printf(" - Configuring GPIO pins...\n");

	stm32f_gpio_af(OTG_FS_DP, GPIO_AF10);
	stm32f_gpio_af(OTG_FS_DM, GPIO_AF10);
	stm32f_gpio_af(OTG_FS_VBUS, GPIO_AF10);
	stm32f_gpio_af(OTG_FS_ID, GPIO_AF10);

	stm32f_gpio_mode(OTG_FS_DP, ALT_FUNC, PUSH_PULL | SPEED_HIGH);
	stm32f_gpio_mode(OTG_FS_DM, ALT_FUNC, PUSH_PULL | SPEED_HIGH);
	stm32f_gpio_mode(OTG_FS_VBUS, ALT_FUNC, SPEED_LOW);
	stm32f_gpio_mode(OTG_FS_ID, ALT_FUNC, PUSH_PULL | SPEED_HIGH);
}

void usb_enumaration_wait(struct stm32f_otg_fs * otg_fs)
{
	while (!(otg_fs->gintsts & OTG_FS_ENUMDNE)) {
		printf(".");
		udelay(100000);
	}
	printf(" - Enumaration speed: %d.\n", OTG_FS_ENUMSPD_GET(otg_fs->dsts));
	printf(" - USB Enumeration done.\n");
}

void usb_reset_wait(struct stm32f_otg_fs * otg_fs)
{
	while (!(otg_fs->gintsts & OTG_FS_USBRST)) {
		printf(".");
		udelay(100000);
	}
	printf(" - USB reset done.\n");
}

int main(int argc, char ** argv)
{
	cm3_udelay_calibrate();
	stdout = stm32f_usart_open(STM32F_UART5, 115200, SERIAL_8N1);

	printf("\n");
	printf("-------------------------------------------------------------------------\n");
	printf("- USB test\n");
	printf("-------------------------------------------------------------------------\n");
	printf("\n");

	usb_io_init();
	usb_device_init(&usb_dev);
//	usb_setup();

	for (;;) {
/*		if ((len = eth_recv(frame, 2048)) > 0) {
			printf("+");
			eth_input((uint8_t *)frame, len);
		} */
	}

	return 0;
}


